{
  "movies": [
    {
      "title": "Black Hawk Down",
      "poster": "https://m.media-amazon.com/images/M/MV5BYWMwMzQxZjQtODM1YS00YmFiLTk1YjQtNzNiYWY1MDE4NTdiXkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_SX300.jpg",
      "year": "2001",
      "genre": "Drama, History, War",
      "director": "Ridley Scott",
      "plot": "160 elite U.S. soldiers drop into Somalia to capture two top lieutenants of a renegade warlord and find themselves in a desperate battle with a large force of heavily-armed Somalis.",
      "actors": "Josh Hartnett, Ewan McGregor, Tom Sizemore, Eric Bana",
      "id": 2,
      "plotShow": false,
      "rating": "8"
    },
    {
      "title": "Dune",
      "rating": "7.9",
      "poster": "https://image.tmdb.org/t/p/w200/d5NXSklXo0qyIYkgV94XAgMIckC.jpg",
      "year": "2021",
      "genre": "No Genre",
      "director": "No Director",
      "plot": "Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, must travel to the most dangerous planet in the universe to ensure the future of his family and his people. As malevolent forces explode into conflict over the planet's exclusive supply of the most precious resource in existence-a commodity capable of unlocking humanity's greatest potential-only those who can conquer their fear will survive.",
      "actors": "No Actors",
      "id": 8
    },
    {
      "title": "Mad Max: Fury Road",
      "rating": "7.5",
      "poster": "https://image.tmdb.org/t/p/w200/8tZYtuWezp8JbcsvHYO0O46tFbo.jpg",
      "year": "2015",
      "genre": "No Genre",
      "director": "No Director",
      "plot": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order.",
      "actors": "No Actors",
      "id": 14
    },
    {
      "title": "The Batman",
      "rating": "8.2",
      "poster": "https://image.tmdb.org/t/p/w200/74xTEgt7R36Fpooo50r9T25onhq.jpg",
      "year": "2022",
      "genre": "No Genre",
      "director": "No Director",
      "plot": "In his second year of fighting crime, Batman uncovers corruption in Gotham City that connects to his own family while facing a serial killer known as the Riddler.",
      "actors": "No Actors",
      "id": 16
    },
    {
      "title": "The Shawshank Redemption",
      "rating": "8.7",
      "poster": "https://image.tmdb.org/t/p/w200/q6y0Go1tsGEsmtFryDOJo3dEmqu.jpg",
      "year": "1994",
      "genre": "No Genre",
      "director": "No Director",
      "plot": "Framed in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.",
      "actors": "No Actors",
      "id": 18
    },
    {
      "title": "Star Wars",
      "rating": "8.2",
      "poster": "https://image.tmdb.org/t/p/w200/6FfCtAuVAW8XJjZ7eWeLibRLWTw.jpg",
      "year": "1977",
      "genre": "No Genre",
      "director": "No Director",
      "plot": "Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.",
      "actors": "No Actors",
      "id": 20
    },
    {
      "title": "Braveheart",
      "rating": "7.9",
      "poster": "https://image.tmdb.org/t/p/w200/or1gBugydmjToAEq7OZY0owwFk.jpg",
      "year": "1995",
      "genre": "No Genre",
      "director": "No Director",
      "plot": "Enraged at the slaughter of Murron, his new bride and childhood love, Scottish warrior William Wallace slays a platoon of the local English lord's soldiers. This leads the village to revolt and, eventually, the entire country to rise up against English rule.",
      "actors": "No Actors",
      "id": 22
    },
    {
      "title": "Ratatouille",
      "rating": "7.8",
      "poster": "https://image.tmdb.org/t/p/w200/npHNjldbeTHdKKw28bJKs7lzqzj.jpg",
      "year": "2007",
      "genre": "No Genre",
      "director": "No Director",
      "plot": "Remy, a resident of Paris, appreciates good food and has quite a sophisticated palate. He would love to become a chef so he can create and enjoy culinary masterpieces to his heart's delight. The only problem is, Remy is a rat. When he winds up in the sewer beneath one of Paris' finest restaurants, the rodent gourmet finds himself ideally placed to realize his dream.",
      "actors": "No Actors",
      "id": 24
    },
    {
      "title": "Harry Potter and the Prisoner of Azkaban",
      "rating": "8",
      "poster": "https://image.tmdb.org/t/p/w200/aWxwnYoe8p2d2fcxOqtvAtJ72Rw.jpg",
      "year": "2004",
      "genre": "No Genre",
      "director": "No Director",
      "plot": "Year three at Hogwarts means new fun and challenges as Harry learns the delicate art of approaching a Hippogriff, transforming shape-shifting Boggarts into hilarity and even turning back time. But the term also brings danger: soul-sucking Dementors hover over the school, an ally of the accursed He-Who-Cannot-Be-Named lurks within the castle walls, and fearsome wizard Sirius Black escapes Azkaban. And Harry will confront them all.",
      "actors": "No Actors",
      "id": 26
    }
  ]
}